{
    "audioFile": "/call4.wav",
    "representativeName": "Eddie",
    "customerName": "Bobby",
    "date": "04/22/2024",
    "callLength": 5,
    "summary": "This is a call summary",
    "transcription": [
        {
            "speaker": "Eddie",
            "text": "Hey there, I'm calling from ICBC. My name is Eddie. Looking to speak with Bobby. Please."
        },
        {
            "speaker": "Eddie",
            "text": "Bobby speaking."
        },
        {
            "speaker": "Eddie",
            "text": "Hey there, Bobby, just calling for let's say 10 to 15 minutes just to give you a bit of an update. Is this a?"
        },
        {
            "speaker": "Eddie",
            "text": "Good time? Not sure."
        },
        {
            "speaker": "Eddie",
            "text": "Absolutely. Fantastic. Thank you so much. Yeah, we'll make sure we go over. My role, of course as, as you know, is to really help you with understanding your recovery and setting up your claim and give you all the benefits that you need to get you better. And part of that involves your treatment and."
        },
        {
            "speaker": "Eddie",
            "text": "Treatment plans that we receive. So we'll go over some of the decisions we've made and I want to make sure that you really understand that as."
        },
        {
            "speaker": "Bobby",
            "text": "Well, yeah. OK, sure."
        },
        {
            "speaker": "Eddie",
            "text": "Jump into that. Do you have any questions I can help you out with?"
        },
        {
            "speaker": "Bobby",
            "text": "No, not really."
        },
        {
            "speaker": "Eddie",
            "text": "No, anything about your mileage expenses or anything about your equipment that you've recently purchased. How's that been going?"
        },
        {
            "speaker": "Bobby",
            "text": "No, not really. What do you mean by equipment?"
        },
        {
            "speaker": "Eddie",
            "text": "I'm glad you asked. Some of the equipment that your physiotherapist recommended. Umm, do you remember about? I think there was the I'm just taking a look at my notes, I think there was the foam roller and the therapeans. How, how, how's that exercise been going?"
        },
        {
            "speaker": "Bobby",
            "text": "Oh, fine."
        },
        {
            "speaker": "Eddie",
            "text": "Anything else you'd like to share about working with that physiotherapist that we should know about though?"
        },
        {
            "speaker": "Bobby",
            "text": "No, it's been good. The, the equipment's working. It's good."
        },
        {
            "speaker": "Eddie",
            "text": "That's great to hear."
        },
        {
            "speaker": "Eddie",
            "text": "Thanks so much for sharing and and for yourself. How are you finding the progress? Are you getting back to where you were before the?"
        },
        {
            "speaker": "Bobby",
            "text": "Crash I I guess. I guess it's been OK, yeah."
        },
        {
            "speaker": "Eddie",
            "text": "How I guess can you share how close are you getting to that in terms of your recovery?"
        },
        {
            "speaker": "Bobby",
            "text": "I guess I'm doing fine. The physiotherapist seems to think it's going OK. So I good, I guess."
        },
        {
            "speaker": "Eddie",
            "text": "I think you're doing really, I think you're really doing really good. I mean, looking at the progress that you're making, I'm looking at the treatment plans, I'm looking at our consultation that we had with your physiotherapist. I think you're doing really great actually. So you might be selling yourself a little bit short here, but I think we're seeing some great progress."
        },
        {
            "speaker": "Eddie",
            "text": "Great. So just working with you on some of your other benefits as well. I just want to make sure I touch on your mileage."
        },
        {
            "speaker": "Eddie",
            "text": "How's the submission been? Like, have you had all your reimbursements received properly?"
        },
        {
            "speaker": "Eddie",
            "text": "Any time it works, whichever is convenient for you, we have technically up to 180 days from the date that you incur them, OK?"
        },
        {
            "speaker": "Bobby",
            "text": "I thought that's OK. Thanks. OK."
        },
        {
            "speaker": "Eddie",
            "text": "Great. Now before I go into the treatment plan in itself and I'll share a little bit about the details here."
        },
        {
            "speaker": "Eddie",
            "text": "Um, I do want to share that the physiotherapist has indicated that you've made some really great progress and you're largely recovered and at this point you're ready for discharge from the physiotherapy services. So with this treatment plan, I think you do still have two more treatments left and you'll be able to finish those last two and go from there. How's that sound?"
        },
        {
            "speaker": "Bobby",
            "text": "That's good. That's good to know. Is there anything else that you need from me? Anything else I need to do?"
        },
        {
            "speaker": "Eddie",
            "text": "At this point, I think it really comes down to for yourself, like anything that you feel like you need before you so that you can get back to where you were before the."
        },
        {
            "speaker": "Bobby",
            "text": "Crash. I guess I'm OK. I."
        },
        {
            "speaker": "Eddie",
            "text": "Mine is also good, So what we'll do is if there's any more recommendations from your physiotherapist as you wrap up the last two sessions."
        },
        {
            "speaker": "Eddie",
            "text": "I just want to really encourage you to give me a call, e-mail me. I'll be available for you on Monday to Friday and 8:00 to 4:00. So as you know, just give me a shout and then I'm happy to walk through those options with you if they have any further."
        },
        {
            "speaker": "Eddie",
            "text": "Not a problem, Not a problem. And what I'll do is I will send you an e-mail. I'll actually summarize what we talked about today for you."
        },
        {
            "speaker": "Eddie",
            "text": "And really just celebrate what a great job you've done in your recovery. And then also, I'll be checking in with you in two weeks. Would you prefer that I e-mail you? Would you prefer that I call you or you just give me a call when you're ready? What's?"
        },
        {
            "speaker": "Eddie",
            "text": "Easier for you."
        },
        {
            "speaker": "Bobby",
            "text": "Anything works for me, really. It's it's fine whichever when you want to do sure."
        },
        {
            "speaker": "Eddie",
            "text": "To close the file in three weeks and if I don't hear back from you."
        },
        {
            "speaker": "Eddie",
            "text": "Then we'll close it. But if you do have anything that comes up in the meantime, then just give me a call how?"
        },
        {
            "speaker": "Bobby",
            "text": "About that, yeah, that sounds good. Thanks."
        },
        {
            "speaker": "Eddie",
            "text": "Okay. Absolutely fantastic. It's always a pleasure talking to you. I really enjoy sharing this update with you, working with you on this, so anything else just give me."
        },
        {
            "speaker": "Bobby",
            "text": "A call. OK. Thanks, Eddie."
        },
        {
            "speaker": "Eddie",
            "text": "Great. Thank you."
        }
    ],
    "flags": []
}